Fixed for docker build
